OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f072cxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <description>desc DAC</description>
      <groupName>DAC</groupName>
      <baseAddress>0x40007400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM6_LPTIM1_DAC</name>
        <description>TIM6, LPTIM1, DAC global Interrupts</description>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN1</name>
              <description>desc EN1</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOFF1</name>
              <description>desc BOFF1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TEN1</name>
              <description>desc TEN1</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TSEL1</name>
              <description>desc TSEL1</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>WAVE1</name>
              <description>desc WAVE1</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MAMP1</name>
              <description>desc MAMP1</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DMAEN1</name>
              <description>desc DMAEN1</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMAUDRIE1</name>
              <description>desc DMAUDRIE1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EN2</name>
              <description>desc EN2</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BOFF2</name>
              <description>desc BOFF2</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TEN2</name>
              <description>desc TEN2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TSEL2</name>
              <description>desc TSEL2</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>WAVE2</name>
              <description>desc WAVE2</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MAMP2</name>
              <description>desc MAMP2</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>DMAEN2</name>
              <description>desc DMAEN2</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAUDRIE2</name>
              <description>desc DMAUDRIE2</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIGR</name>
          <description>desc SWTRIGR</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SWTRIG1</name>
              <description>desc SWTRIG1</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SWTRIG2</name>
              <description>desc SWTRIG2</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R1</name>
          <description>desc DHR12R1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L1</name>
          <description>desc DHR12L1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R1</name>
          <description>desc DHR8R1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R2</name>
          <description>desc DHR12R2</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L2</name>
          <description>desc DHR12L2</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R2</name>
          <description>desc DHR8R2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12RD</name>
          <description>desc DHR12RD</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12LD</name>
          <description>desc DHR12LD</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <bitRange>[15:4]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <bitRange>[31:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8RD</name>
          <description>desc DHR8RD</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR1</name>
          <description>desc DOR1</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DACC1DOR</name>
              <description>desc DACC1DOR</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR2</name>
          <description>desc DOR2</description>
          <addressOffset>0x30</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DACC2DOR</name>
              <description>desc DACC2DOR</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>DMAUDR1</name>
              <description>desc DMAUDR1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DMAUDR2</name>
              <description>desc DMAUDR2</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
