OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f072cxx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>REV_ID</name>
              <description>REV_ID</description>
              <bitRange>[30:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Debug MCU Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <description>Debug Sleep Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <displayName>APB_FZ1</displayName>
          <description>APB Freeze Register1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER2_STOP</name>
              <description>Debug Timer 2 stopped when Core is halted</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER3_STOP</name>
              <description>Debug Timer 3 stopped when Core is halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER6_STOP</name>
              <description>Debug Timer 6 stopped when Core is halted</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER7_STOP</name>
              <description>Debug Timer 7 stopped when Core is halted</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <description>Debug RTC stopped when Core is halted</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <description>Debug Window Wachdog stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug Independent Wachdog stopped when Core is halted</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_CAN_STOP</name>
              <description>DBG_CAN_STOP</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DBG_I2C1_SMBUS_TIMEOUT</name>
              <description>DBG_I2C1_SMBUS_TIMEOUT</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBG_I2C2_SMBUS_TIMEOUT</name>
              <description>DBG_I2C2_SMBUS_TIMEOUT</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <description>Debug LPTIM stopped when Core is halted</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <displayName>APB_FZ2</displayName>
          <description>APB Freeze Register2</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER1_STOP</name>
              <description>Debug Timer 1 stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER14_STOP</name>
              <description>Debug Timer 14 stopped when Core is halted</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER15_STOP</name>
              <description>Debug Timer 15 stopped when Core is halted</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER16_STOP</name>
              <description>Debug Timer 16 stopped when Core is halted</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER17_STOP</name>
              <description>Debug Timer 17 stopped when Core is halted</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DIV</name>
      <description>Hardware Divider</description>
      <groupName>DIV</groupName>
      <baseAddress>0x40023800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DEND</name>
          <displayName>DEND</displayName>
          <description>Dividend</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DEND</name>
              <description>Dividend</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOR</name>
          <displayName>SOR</displayName>
          <description>Divisor</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SOR</name>
              <description>Divisor</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>QUOT</name>
          <displayName>QUOT</displayName>
          <description>Quotient</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>QUOT</name>
              <description>Quotient</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REMA</name>
          <displayName>REMA</displayName>
          <description>Remainder</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>REMA</name>
              <description>Remainder</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGN</name>
          <displayName>SIGN</displayName>
          <description>des SIGN</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DIV_SIGN</name>
              <description>des DIV_SIGN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>des SIGN</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>DIV_END</name>
              <description>des DIV_END</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DIV_ZERO</name>
              <description>des DIV_ZERO</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
