OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f072cxx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART2</name>
      <baseAddress>0x40004400</baseAddress>
      <interrupt>
        <name>USART2</name>
        <description>USART2 global Interrupt</description>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART3</name>
      <description>desc USART</description>
      <groupName>USART</groupName>
      <baseAddress>0x40004800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART3_4</name>
        <description>USART3, 4 global Interrupts</description>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
      <name>USART4</name>
      <description>desc USART</description>
      <groupName>USART</groupName>
      <baseAddress>0x40004C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART3_4</name>
        <description>USART3, 4 global Interrupts</description>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>USB</description>
      <groupName>USB</groupName>
      <baseAddress>0x40005C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB</name>
        <description>USB global Interrupts</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>CR</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>UPDATE</name>
              <description>UPDATE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>Enable_Suspend</name>
              <description>Enable_Suspend</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>Suspend_Mode</name>
              <description>Suspend_Mode</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>Resume</name>
              <description>Resume</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>Reset</name>
              <description>Reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ISO_Update</name>
              <description>ISO_Update</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <displayName>INTR</displayName>
          <description>INTR</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>Suspend</name>
              <description>Suspend</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>Resume</name>
              <description>Resume</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>Reset</name>
              <description>Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOF</name>
              <description>SOF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EP1OUT</name>
              <description>EP1OUT</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EP2OUT</name>
              <description>EP2OUT</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EP3OUT</name>
              <description>EP3OUT</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EP4OUT</name>
              <description>EP4OUT</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EP5OUT</name>
              <description>EP5OUT</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EP0</name>
              <description>EP0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EP1IN</name>
              <description>EP1IN</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EP2IN</name>
              <description>EP2IN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EP3IN</name>
              <description>EP3IN</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EP4IN</name>
              <description>EP4IN</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EP5IN</name>
              <description>EP5IN</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTRE</name>
          <displayName>INTRE</displayName>
          <description>INTRE</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EN_Suspend</name>
              <description>EN_Suspend</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EN_Resume</name>
              <description>EN_Resume</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EN_Reset</name>
              <description>EN_Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EN_SOF</name>
              <description>EN_SOF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EP1OUTE</name>
              <description>EP1OUTE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EP2OUTE</name>
              <description>EP2OUTE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EP3OUTE</name>
              <description>EP3OUTE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EP4OUTE</name>
              <description>EP4OUTE</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EP5OUTE</name>
              <description>EP5OUTE</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EP0</name>
              <description>EP0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EP1INE</name>
              <description>EP1INE</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EP2INE</name>
              <description>EP2INE</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EP3INE</name>
              <description>EP3INE</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EP4INE</name>
              <description>EP4INE</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EP5INE</name>
              <description>EP5INE</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME</name>
          <displayName>FRAME</displayName>
          <description>FRAME</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FramNUM</name>
              <description>FramNUM</description>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>INDEX</name>
              <description>INDEX</description>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EP0CSR</name>
          <displayName>EP0CSR</displayName>
          <description>EP0CSR</description>
          <addressOffset>0x10</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>OutPktRdy</name>
              <description>OutPktRdy</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>InPktRdy</name>
              <description>InPktRdy</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SentStall</name>
              <description>SentStall</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DataEnd</name>
              <description>DataEnd</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SetupEnd</name>
              <description>SetupEnd</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SendStall</name>
              <description>OutPktRdy</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ServicedOutPktRdy</name>
              <description>ServicedOutPktRdy</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ServicedSetupEnd</name>
              <description>ServicedSetupEnd</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COUNT0</name>
              <description>COUNT0</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INEPxCSR</name>
          <displayName>INEPxCSR</displayName>
          <description>INEPxCSR</description>
          <addressOffset>0x14</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FrcDataTog</name>
              <description>FrcDataTog</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEnab</name>
              <description>DMAEnab</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>Mode</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ISO</name>
              <description>ISO</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AutoSet</name>
              <description>AutoSet</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>InPktRdy</name>
              <description>InPktRdy</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFONotEmpty</name>
              <description>FIFONotEmpty</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UnderRun</name>
              <description>UnderRun</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FlushFIFO</name>
              <description>FlushFIFO</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SendStall</name>
              <description>SendStall</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SentStall</name>
              <description>SentStall</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ClrDataTog</name>
              <description>ClrDataTog</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>INMAXP</name>
              <description>INMAXP</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTEPxCSR</name>
          <displayName>OUTEPxCSR</displayName>
          <description>OUTEPxCSR</description>
          <addressOffset>0x18</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMAMode</name>
              <description>DMAMode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEnab</name>
              <description>DMAEnab</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ISO</name>
              <description>ISO</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AutoClear</name>
              <description>AutoClear</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OutPktRdy</name>
              <description>OutPktRdy</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FIFOFull</name>
              <description>FIFOFull</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OverRun</name>
              <description>OverRun</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DataError</name>
              <description>DataError</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FlushFIFO</name>
              <description>FlushFIFO</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SendStall</name>
              <description>SendStall</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SentStall</name>
              <description>SentStall</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ClrDataTog</name>
              <description>ClrDataTog</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>INMAXP</name>
              <description>INMAXP</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCOUNT</name>
          <displayName>OUTCOUNT</displayName>
          <description>OUTCOUNT</description>
          <addressOffset>0x1C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>OUTCOUNT</name>
              <description>OUTCOUNT</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
